package home.home_work_1;

/**
 * 1.1. http://developer.alexanderklimov.ru/android/java/bitwise.php
 * 	1.2 Использовать ВСЕ возможные побитовые операции с числами 42 и 15.
 * 	1.3 Использовать ВСЕ возможные побитовые операции с числами -42 и -15.
 * 	1.4 В комментариях к каждой операции написать двоичный код каждого числа и результата операции.
 * 	1.5 Попробуйте сделать побитовую операцию с числова 42.5
 *
 * @author Kukharonok Andrey
 */
public class Task1 {
    public static void main(String[] args) {
        int result;
        int operand1 = 42;//bin 101010
        int operand2 = 15;//bin 001111
        double operand3 = 42.5;
        result = operand1 & operand2;//10;  bin 1010  Побитовый AND
        result = operand1 | operand2;//47;  bin 101111  Побитовый OR
        result = operand1 ^ operand2;//37;  bin 100101  Побитовый исключающее OR
        result = ~operand1;//-43;  bin 11111111111111111111111111010101  Побитовый унарный оператор NOT
        result = ~operand2;//-16;  bin  11111111111111111111111111110000  Побитовый унарный оператор NOT
        result = operand1 >> 3;//5;  bin 101  Сдвиг вправо на 3
        result = operand2 >> 2;//3;  bin 11  Сдвиг вправо на 2
        result = operand1 << 3;//336;  bin 101010000  Сдвиг влево на 3
        result = operand2 << 2;//60;  bin 111100  Сдвиг влево на 2
        result = operand1 >>> 3;//5;  bin 101  Сдвиг вправо с заполнением нулями
        result = operand2 >>> 2;//3;  bin 11  Сдвиг вправо с заполнением нулями

        operand1 &= operand2;//10;  bin 1010  Побитовый AND с присваиванием
        operand1 = 42;//bin 101010
        operand1 |= operand2;//47;  bin 101111  Побитовый OR с присваиванием
        operand1 = 42;//bin 101010
        operand1 ^= operand2;//37;  bin 100101  Побитовый исключающее OR с присваиванием
        operand1 = 42;//bin 101010
        operand1 >>= 2;//10;  bin 1010  Сдвиг вправо на 2 с присваиванием
        operand1 = 42;//bin 101010
        operand1 <<= 2;//168;  bin 10101000  Сдвиг влево на 2 с присваиванием
        operand1 = 42;//bin 101010
        operand1 >>>= 2;//10;  bin 1010  Сдвиг вправо с заполнением нулями с присваиванием

        operand2 >>= 3;//1;  bin 1  Сдвиг вправо на 3 с присваиванием
        operand2 = 15;//bin 001111
        operand2 <<= 3;//120;  bin 1111000  Сдвиг влево на 3 с присваиванием
        operand2 = 15;//bin 001111
        operand2 >>>= 1;//7;  bin 111  Сдвиг вправо с заполнением нулями с присваиванием

        //operand3 >>= 2;// ошибка компиляции - побитовые операторы не применяются для чисел с плавающей точкой

        int result2;
        int operand4 = -42;//bin 11111111111111111111111111010110
        int operand5 = -15;//bin 11111111111111111111111111110001
        result2 = operand4 & operand5;//-48; bin 11111111111111111111111111010000  Побитовый AND
        result2 = operand4 | operand5;//-9;  bin 11111111111111111111111111110111  Побитовый OR
        result2 = operand4 ^ operand5;//39;  bin 100111  Побитовый исключающее OR
        result2 = ~operand4;//41;  bin 101001  Побитовый унарный оператор NOT
        result2 = ~operand5;//14;  bin  1110  Побитовый унарный оператор NOT
        result2 = operand4 >> 3;//-6;  bin 11111111111111111111111111111010  Сдвиг вправо на 3
        result2 = operand5 >> 2;//-4;  bin 11111111111111111111111111111100  Сдвиг вправо на 2
        result2 = operand4 << 3;//-336;  bin 11111111111111111111111010110000  Сдвиг влево на 3
        result2 = operand5 << 2;//-60;  bin 11111111111111111111111111000100  Сдвиг влево на 2
        result2 = operand4 >>> 20;//4095;  bin 111111111111  Сдвиг вправо с заполнением нулями
        result2 = operand5 >>> 3;//536870910;  bin 11111111111111111111111111110  Сдвиг вправо с заполнением нулями

        operand4 &= operand5;//-48; bin 11111111111111111111111111010000  Побитовый AND с присваиванием
        operand4 = -42;//bin 11111111111111111111111111010110
        operand4 |= operand5;//-9;  bin 11111111111111111111111111110111  Побитовый OR с присваиванием
        operand4 = -42;//bin 11111111111111111111111111010110
        operand4 ^= operand5;//39;  bin 100111  Побитовый исключающее OR с присваиванием
        operand4 = -42;//bin 11111111111111111111111111010110
        operand4 >>= 2;//-11;  bin 11111111111111111111111111110101  Сдвиг вправо на 2 с присваиванием
        operand4 = -42;//bin 11111111111111111111111111010110
        operand4 <<= 2;//-168;  bin 11111111111111111111111101011000  Сдвиг влево на 2 с присваиванием
        operand4 = -42;//bin 11111111111111111111111111010110
        operand4 >>>= 25;//127;  bin 1111111  Сдвиг вправо с заполнением нулями с присваиванием

        operand5 >>= 3;//-2;  bin 11111111111111111111111111111110  Сдвиг вправо на 3 с присваиванием
        operand5 = -15;//bin 11111111111111111111111111110001
        operand5 <<= 3;//-120;  bin 11111111111111111111111110001000  Сдвиг влево на 3 с присваиванием
        operand5 = -15;//bin 11111111111111111111111111110001
        operand5 >>>= 22;//1023;  bin 1111111111  Сдвиг вправо с заполнением нулями с присваиванием
    }
}
